IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItemKeys</name>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
      <types>CatalogRef.Boxes</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.Specifications</types>
    </type>
  </attributes>
  <attributes>
    <name>AffectPricingMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UniqueMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchLiteral</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecificationAffectPricingMD5</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>AffectPricingMD5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/SpecificationType/SpecificationType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>SpecificationType</name>
 <enumValues>
  <name>Bundle</name>
 </enumValues>
 <enumValues>
  <name>Set</name>
 </enumValues>
 <enumValues>
  <name>BundleByItemKey</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/ItemKeys/ObjectModule.bsl
Procedure BeforeWrite(Cancel)
	If ValueIsFilled(ThisObject.Specification) Then
		ThisObject.AddAttributes.Clear();
	EndIf;
	For Each Row In ThisObject.AddAttributes Do
		If TypeOf(Row.Value) = Type("Number") Then
			Row.SearchLiteral = String(Row.Value);
		EndIf;
	EndDo;
	
	ThisObject.SpecificationAffectPricingMD5.Clear();
	
	// Unique MD5
	If ValueIsFilled(ThisObject.Specification) Then
		ValueTable = New ValueTable();
		ValueTable.Columns.Add("SpecificationUniqueMD5");
		ValueTable.Columns.Add("Item");
		
		NewRow = ValueTable.Add();
		NewRow.SpecificationUniqueMD5 = ThisObject.Specification.UniqueMD5;
		NewRow.Item = String(ThisObject.Item.UUID());
		
		ThisObject.UniqueMD5 = AddAttributesAndPropertiesServer.GetMD5ForValueTable(ValueTable);
		If ValueIsFilled(UniqueID.FindRefByUniqueMD5(ThisObject, ThisObject.UniqueMD5)) Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_065);
		EndIf;
	Else
		ValueTable = New ValueTable();
		ValueTable.Columns.Add("Property");
		ValueTable.Columns.Add("Value");
		ValueTable.Columns.Add("Item");
			
		If Not ThisObject.AddAttributes.Count() Then
			NewRow = ValueTable.Add();
			NewRow.Property = ChartsOfCharacteristicTypes.AddAttributeAndProperty.EmptyRef();
			NewRow.Value = Undefined;
			NewRow.Item = ThisObject.Item;
		Else
			For Each Row In ThisObject.AddAttributes Do
				NewRow = ValueTable.Add();
				NewRow.Property = Row.Property;
				NewRow.Value = Row.Value;
				NewRow.Item = ThisObject.Item;
			EndDo;
		EndIf;
			
		ThisObject.UniqueMD5 = AddAttributesAndPropertiesServer.GetMD5ByAddAttributes(ValueTable);
		If ValueIsFilled(UniqueID.FindRefByUniqueMD5(ThisObject, ThisObject.UniqueMD5)) Then
			Cancel = True;
			CommonFunctionsClientServer.ShowUsersMessage(R().Error_065);
		EndIf;
	EndIf;
	
	If Cancel Then
		Return;
	EndIf;
	
	If AdditionalProperties.Property("SynhronizeAffectPricingMD5")
		And AdditionalProperties.SynhronizeAffectPricingMD5 Then
		
		If AdditionalProperties.Property("AffectPricingMD5") Then
			SetAffectPricingMD5(AdditionalProperties.AffectPricingMD5);
		EndIf;
		
		If AdditionalProperties.Property("TableOfAffectPricingMD5") Then
			SetSpecificationAffectPricingMD5(AdditionalProperties.TableOfAffectPricingMD5);
		EndIf;
		
	Else
		If ValueIsFilled(ThisObject.Item) And ValueIsFilled(ThisObject.Item.ItemType) Then
			If ValueIsFilled(ThisObject.Specification) Then
				
				// Set
				If ThisObject.Specification.Type = Enums.SpecificationType.Set Then
					SetSpecificationAffectPricingMD5(
						Catalogs.ItemKeys.CalculateMD5ForSet(ThisObject.Specification.DataQuantity.Unload()
							, ThisObject.Specification.DataSet.Unload()
							, ThisObject.Item
							, ThisObject.Item.ItemType));
				EndIf;
				
				// Bundle	
				If ThisObject.Specification.Type = Enums.SpecificationType.Bundle Then
					SetSpecificationAffectPricingMD5(
						Catalogs.ItemKeys.CalculateMD5ForBundle(ThisObject.Specification.DataQuantity.Unload()
							, ThisObject.Specification.DataSet.Unload()
							, ThisObject.Item
							, ThisObject.Item.ItemType));
				EndIf;
				
			Else
				
				// Regular
				SetAffectPricingMD5(
					AddAttributesAndPropertiesServer.GetAffectPricingMD5(ThisObject.Item
						, ThisObject.Item.ItemType
						, ThisObject.AddAttributes.Unload()));
			EndIf;
		EndIf;
	EndIf;
EndProcedure

Procedure SetAffectPricingMD5(AffectPricingMD5)
	ThisObject.AffectPricingMD5 = AffectPricingMD5;
EndProcedure

Procedure SetSpecificationAffectPricingMD5(TableOfAffectPricingMD5)
	ThisObject.SpecificationAffectPricingMD5.Load(TableOfAffectPricingMD5);
EndProcedure

Procedure OnWrite(Cancel)
	RefreshReusableValues();
EndProcedure
